andotoecno/UARDECS_esp32/lib/esp32_uecs/esp32_uecs.cpp
	    }
	    

	
	if(enabledCCMNum==0 || returnCCMID<0){return false;}//page num over
	
	UDPAddValueToBuffer(pageNum);
	UDPAddPGMCharToBuffer(&(UECSccm_TOTAL[0]));
	UDPAddValueToBuffer(enabledCCMNum);
    UDPAddPGMCharToBuffer(&(UECSccm_CLOSETAG[0]));
	UDPAddValueToBuffer(1);//Column number is always 1
    UDPAddPGMCharToBuffer(&(UECSccm_CCMNO[0]));
	UDPAddValueToBuffer(pageNum);//page number = ccm number
	
	
	for(i=0;i<3;i++)
	{
	 UDPAddPGMCharToBuffer(UECSattrChar[i]);
	 UDPAddValueToBuffer(U_ccmList[returnCCMID].baseAttribute[i]);
	}
	 UDPAddPGMCharToBuffer(UECSattrChar[AT_PRIO]);
	 UDPAddValueToBuffer(U_ccmList[returnCCMID].attribute[AT_PRIO]);

	 
	 UDPAddPGMCharToBuffer(&(UECSccm_CAST[0]));
	 UDPAddValueToBuffer(U_ccmList[returnCCMID].decimal);
	 UDPAddPGMCharToBuffer(&(UECSccm_UNIT[0]));                          
	 UDPAddPGMCharToBuffer((U_ccmList[returnCCMID].unit));
	 UDPAddPGMCharToBuffer(&(UECSccm_SR[0]));
     if(U_ccmList[returnCCMID].sender){
     	 		UDPAddPGMCharToBuffer(UECSTxtPartS);
              }
              else{
     	 		UDPAddPGMCharToBuffer(UECSTxtPartR);
              }              
	 UDPAddPGMCharToBuffer(&(UECSccm_LV[0]));                          
	 UDPAddPGMCharToBuffer((UECSCCMLEVEL[U_ccmList[returnCCMID].ccmLevel]));
	 UDPAddPGMCharToBuffer(&(UECSccm_CLOSETAG[0]));
	 UDPAddPGMCharToBuffer((U_ccmList[returnCCMID].type));
	 UDPAddPGMCharToBuffer(&(UECSccm_CCMRESCLOSE[0]));  
    
    return true;
    }
    
    return false;
  
  
}


//------------------------------------------------------------------
void UECSautomaticSendManager()
{
for(int id=0;id<U_MAX_CCM;id++)
	{
  if(U_ccmList[id].ccmLevel == NONE || !U_ccmList[id].sender){continue;}

      if(U_ccmList[id].ccmLevel == A_1S_0 || U_ccmList[id].ccmLevel == A_1S_1 || U_ccmList[id].ccmLevel == S_1S_0)
      {
        U_ccmList[id].flagStimeRfirst = true;
       }
       else if((UECSsyscounter60s % 10 == id % 10) && (U_ccmList[id].ccmLevel == A_10S_0 || U_ccmList[id].ccmLevel == A_10S_1))
       {
         U_ccmList[id].flagStimeRfirst = true;
       }
       else if(UECSsyscounter60s == id % 10 && (U_ccmList[id].ccmLevel == A_1M_0 || U_ccmList[id].ccmLevel == A_1M_1 || U_ccmList[id].ccmLevel == S_1M_0))
       {
         U_ccmList[id].flagStimeRfirst = true;
       }
       else{
         U_ccmList[id].flagStimeRfirst = false;
       }
	}
}
//----------------------------------------------------------------------
void UECSautomaticValidManager(unsigned long td)
{
for(int id=0;id<U_MAX_CCM;id++)
	{
  if(U_ccmList[id].ccmLevel == NONE|| U_ccmList[id].sender){continue;}
    	
    	
    	if(U_ccmList[id].recmillis>86400000)//over 24hour
    		{
    			continue;//stop count
    		}

  		U_ccmList[id].recmillis+=td;//count time(ms) since last recieved
  		
  	  unsigned long validmillis=0;
  	  if(U_ccmList[id].ccmLevel == A_1S_0 || U_ccmList[id].ccmLevel == A_1S_1 || U_ccmList[id].ccmLevel == S_1S_0)
  	  {
	    validmillis = 3000;  
  		}
	  	else if(U_ccmList[id].ccmLevel == A_10S_0 || U_ccmList[id].ccmLevel == A_10S_1)
	  	{
    	validmillis = 30000;
  		}
  		else if(U_ccmList[id].ccmLevel == A_1M_0 || U_ccmList[id].ccmLevel == A_1M_1 || U_ccmList[id].ccmLevel == S_1M_0)
  		{
    	validmillis = 180000;
 	 	}
    	
       if(U_ccmList[id].recmillis > validmillis || U_ccmList[id].flagStimeRfirst == false)
       {
         U_ccmList[id].validity = false;  
       }
	}
}

//##############################################################################
//##############################################################################


void UECS_EEPROM_writeLong(int ee, long value)
{
    byte* p = (byte*)(void*)&value;
    for (unsigned int i = 0; i < sizeof(value); i++)
    {
    if(EEPROM.read(ee)!=p[i])//same value skip
    		{
    		EEPROM.write(ee, p[i]);
    		}
    		ee++;
	}

}

long UECS_EEPROM_readLong(int ee)
{
    long value = 0;
    byte* p = (byte*)(void*)&value;
    for (unsigned int i = 0; i < sizeof(value); i++)
	  *p++ = EEPROM.read(ee++);
    return value;
}
//-----------------------------------------------------------new
void HTTPsetInput(short _value){
    HTTPAddPGMCharToBuffer(&(UECShtmlInputText[0]));
    HTTPAddValueToBuffer(_value);
    HTTPAddPGMCharToBuffer(&(UECShtmlINPUTCLOSE3[0]));
}
//-----------------------------------------------------------new
void HTTPprintIPtoHtml(byte address[])
{
  for(int i = 0; i < 3; i++)
  { 
   HTTPsetInput(address[i]);
   HTTPAddPGMCharToBuffer(UECSTxtPartColon);
  }      
  HTTPsetInput(address[3]);
  HTTPAddPGMCharToBuffer(&(UECSbtrag[0]));

}
//-----------------------------------------------------------new
//---------------------------------------------------------------
void HTTPPrintRedirectP1(){
 ClearMainBuffer();
 HTTPAddPGMCharToBuffer(&(UECShttpHead200_OK[0]));
 HTTPAddPGMCharToBuffer(&(UECShttpHeadContentType[0]));
 HTTPAddPGMCharToBuffer(&(UECShttpHeadConnection[0]));
 HTTPAddPGMCharToBuffer(&(UECShtmlHEADER[0]));
 HTTPAddPGMCharToBuffer(&(UECShtmlREDIRECT[0]));
 HTTPCloseBuffer();
}
//-----------------------------------------------------------
void HTTPPrintHeader(){
 ClearMainBuffer();
 
HTTPAddPGMCharToBuffer(&(UECShttpHead200_OK[0]));
HTTPAddPGMCharToBuffer(&(UECShttpHeadContentType[0]));
HTTPAddPGMCharToBuffer(&(UECShttpHeadConnection[0]));
 
 HTTPAddPGMCharToBuffer(&(UECShtmlHEADER[0]));
 HTTPAddPGMCharToBuffer(&(UECShtmlNORMAL[0]));

 if(U_orgAttribute.status & STATUS_MEMORY_LEAK)
 	{HTTPAddPGMCharToBuffer(&(UECShtmlATTENTION_INTERR[0]));}

 if(U_orgAttribute.status & STATUS_SAFEMODE)
 	{HTTPAddPGMCharToBuffer(&(UECShtmlATTENTION_SAFEMODE[0]));}

 HTTPAddPGMCharToBuffer(&(U_name[0]));
 
  HTTPAddPGMCharToBuffer(&(UECShtmlTITLECLOSE[0]));
  
  HTTPAddPGMCharToBuffer(&(UECShtml1A[0]));   // </script></HEAD><BODY><CENTER><H1>
}
//-----------------------------------------------------------
void HTTPsendPageError(){
  HTTPPrintHeader();
  HTTPAddPGMCharToBuffer(&(UECSpageError[0]));      
  HTTPAddPGMCharToBuffer(&(UECShtmlH1CLOSE[0]));
  HTTPAddPGMCharToBuffer(&(UECShtmlHTMLCLOSE[0])); 
  HTTPCloseBuffer();
}
//-------------------------------------------------------------
void HTTPsendPageIndex(){

  HTTPPrintHeader();
  HTTPAddCharToBuffer(U_nodename);
  HTTPAddPGMCharToBuffer(&(UECShtmlH1CLOSE[0]));
  HTTPAddPGMCharToBuffer(&(UECShtmlIndex[0]));
  HTTPAddPGMCharToBuffer(&(UECShtmlHR[0]));
  HTTPAddPGMCharToBuffer(&(U_footnote[0]));
  HTTPAddPGMCharToBuffer(&(UECShtmlHTMLCLOSE[0]));
  HTTPCloseBuffer();
}
//--------------------------------------------------
void HTTPsendPageLANSetting(){
  UECSinitOrgAttribute();

  HTTPPrintHeader();
  HTTPAddCharToBuffer(U_nodename);
  HTTPAddPGMCharToBuffer(UECShtmlH1CLOSE); 
  HTTPAddPGMCharToBuffer(UECShtmlH2TAG);
  HTTPAddPGMCharToBuffer(UECShtmlLANTITLE);
  HTTPAddPGMCharToBuffer(UECShtmlH2CLOSE);  
  HTTPAddPGMCharToBuffer(&(UECShtmlLAN2[0]));  // <form action=\"./h2.htm\" name=\"f\"><p>
  HTTPAddPGMCharToBuffer(&(UECShtmlLAN3A[0]));   // address: 
 byte UECStempByte[4];
  for(int i = 0; i < 4; i++){
    UECStempByte[i] = U_orgAttribute.ip[i];
  }
  HTTPprintIPtoHtml(UECStempByte); // XXX:XXX:XXX:XXX <br>
  
