andotoecno/UARDECS_esp32/lib/esp32_uecs/esp32_uecs.cpp
  HTTPAddPGMCharToBuffer(&(UECShtmlLAN3B[0]));  // subnet: 
  HTTPprintIPtoHtml( U_orgAttribute.subnet); // XXX:XXX:XXX:XXX <br>
  
  HTTPAddPGMCharToBuffer(&(UECShtmlLAN3C[0]));  // gateway: 
  HTTPprintIPtoHtml( U_orgAttribute.gateway); // XXX:XXX:XXX:XXX <br>
  
  HTTPAddPGMCharToBuffer(&(UECShtmlLAN3D[0]));  // dns: 
  HTTPprintIPtoHtml( U_orgAttribute.dns); // XXX:XXX:XXX:XXX <br>

  HTTPAddPGMCharToBuffer(&(UECShtmlLAN3E[0]));  // mac: 
  sprintf(UECStempStr20, "%02X%02X%02X%02X%02X%02X", U_orgAttribute.mac[0], U_orgAttribute.mac[1], U_orgAttribute.mac[2], U_orgAttribute.mac[3], U_orgAttribute.mac[4], U_orgAttribute.mac[5]);
  UDPAddCharToBuffer(UECStempStr20);

  
  HTTPAddPGMCharToBuffer(UECShtmlH2TAG);// <H2>
  HTTPAddPGMCharToBuffer(UECShtmlUECSTITLE); // UECS
  HTTPAddPGMCharToBuffer(UECShtmlH2CLOSE); // </H2>
  
  HTTPAddPGMCharToBuffer(UECShtmlRoom);   
  HTTPsetInput( U_orgAttribute.room);  
  HTTPAddPGMCharToBuffer(UECShtmlRegion);
  HTTPsetInput( U_orgAttribute.region);  
  HTTPAddPGMCharToBuffer(UECShtmlOrder);
  HTTPsetInput( U_orgAttribute.order);
  HTTPAddPGMCharToBuffer(&(UECSbtrag[0]));

  HTTPAddPGMCharToBuffer(&(UECShtmlUECSID[0]));  // uecsid:
  UDPAddPGMCharToBuffer(&(U_uecsid[0]));
  
  HTTPAddPGMCharToBuffer(UECShtmlH2TAG);// <H2>
  HTTPAddPGMCharToBuffer(UECShtmlNAMETITLE); //Node Name
  HTTPAddPGMCharToBuffer(UECShtmlH2CLOSE); // </H2>
  
  HTTPAddPGMCharToBuffer(&(UECShtmlInputText[0]));
  HTTPAddCharToBuffer(U_nodename);
  HTTPAddPGMCharToBuffer(UECShtmlINPUTCLOSE19);
  HTTPAddPGMCharToBuffer(&(UECSbtrag[0]));  
  
  HTTPAddPGMCharToBuffer(&(UECShtmlSUBMIT[0])); // <input name=\"b\" type=\"submit\" value=\"send\">
  HTTPAddPGMCharToBuffer(&(UECSformend[0]));   //</form>
  
    if(U_orgAttribute.status & STATUS_NEEDRESET)
		 {
		 	HTTPAddPGMCharToBuffer(&(UECShtmlATTENTION_RESET[0]));
		 }
  
  HTTPAddPGMCharToBuffer(&(UECShtmlRETURNINDEX[0]));
  HTTPAddPGMCharToBuffer(&(UECShtmlHTMLCLOSE[0]));    //</BODY></HTML>
  HTTPCloseBuffer();

}

//--------------------------------------------------

void HTTPsendPageCCM(){

 HTTPPrintHeader();
HTTPAddCharToBuffer(U_nodename); 
HTTPAddPGMCharToBuffer(&(UECShtmlCCMRecRes0[0])); // </H1><H2>CCM Status</H2><TABLE border=\"1\"><TBODY align=\"center\"><TR><TH>Info</TH><TH>S/R</TH><TH>Type</TH><TH>SR Lev</TH><TH>Value</TH><TH>Valid</TH><TH>Sec</TH><TH>Atr</TH><TH>IP</TH></TR>

 for(int i = 0; i < U_MAX_CCM; i++){
 if(U_ccmList[i].ccmLevel != NONE){
 	
HTTPAddPGMCharToBuffer(&(UECStrtd[0])); //<tr><td>
HTTPAddPGMCharToBuffer(U_ccmList[i].name); 
HTTPAddPGMCharToBuffer(&(UECStdtd[0])); //</td><td>
 if(U_ccmList[i].sender){
 HTTPAddPGMCharToBuffer(UECSTxtPartS);
 }else{
 HTTPAddPGMCharToBuffer(UECSTxtPartR);
 } 

HTTPAddPGMCharToBuffer(&(UECStdtd[0])); //</td><td>
HTTPAddPGMCharToBuffer(U_ccmList[i].type); 
HTTPAddPGMCharToBuffer(&(UECStdtd[0])); //</td><td> 

 
HTTPAddPGMCharToBuffer((UECSCCMLEVEL[U_ccmList[i].ccmLevel])); //******

HTTPAddPGMCharToBuffer(&(UECStdtd[0])); //</td><td> 

 dtostrf(((double)U_ccmList[i].value) / pow(10, U_ccmList[i].decimal), -1, U_ccmList[i].decimal,UECStempStr20);
HTTPAddCharToBuffer(UECStempStr20);
HTTPAddPGMCharToBuffer(&(UECStdtd[0])); //</td><td>
 if(U_ccmList[i].sender){

 }else{
 if(U_ccmList[i].validity){
 HTTPAddPGMCharToBuffer(UECSTxtPartOK);
 }else{
 HTTPAddPGMCharToBuffer(UECSTxtPartHyphen);
 }

 } 

HTTPAddPGMCharToBuffer(&(UECStdtd[0])); //</td><td> 
 
 if(U_ccmList[i].flagStimeRfirst && U_ccmList[i].sender == false)
 {
 	 if(U_ccmList[i].recmillis<36000000)
 	 	{HTTPAddValueToBuffer(U_ccmList[i].recmillis / 1000);}
 }
 else{
 	 //over 10hour
 } 

HTTPAddPGMCharToBuffer(&(UECStdtd[0])); //</td><td> 
 
 if(U_ccmList[i].flagStimeRfirst && U_ccmList[i].sender == false){
 sprintf(UECStempStr20, "%d-%d-%d-%d", U_ccmList[i].attribute[AT_ROOM], U_ccmList[i].attribute[AT_REGI], U_ccmList[i].attribute[AT_ORDE], U_ccmList[i].attribute[AT_PRIO]);
HTTPAddCharToBuffer(UECStempStr20); 
 }
 sprintf(UECStempStr20, "(%d-%d-%d)", U_ccmList[i].baseAttribute[AT_ROOM], U_ccmList[i].baseAttribute[AT_REGI], U_ccmList[i].baseAttribute[AT_ORDE]); 
HTTPAddCharToBuffer(UECStempStr20);
HTTPAddPGMCharToBuffer(&(UECStdtd[0])); //</td><td> 
 
 
HTTPAddPGMCharToBuffer(&(UECSAHREF[0])); 
 sprintf(UECStempStr20, "%d.%d.%d.%d", U_ccmList[i].address[0], U_ccmList[i].address[1], U_ccmList[i].address[2], U_ccmList[i].address[3]); 
HTTPAddCharToBuffer(UECStempStr20);
HTTPAddPGMCharToBuffer(&(UECSTagClose[0]));
HTTPAddCharToBuffer(UECStempStr20);
HTTPAddPGMCharToBuffer(&(UECSSlashA[0]));
 
HTTPAddPGMCharToBuffer(&(UECStdtr[0])); //</td></tr> 
  
 } //NONE route
 }
 
 
HTTPAddPGMCharToBuffer(&(UECShtmlTABLECLOSE[0])); //</TBODY></TABLE>
 
if(U_HtmlLine>0) {
HTTPAddPGMCharToBuffer(&(UECShtmlUserRes0[0])); // </H1><H2>Status</H2><TABLE border=\"1\"><TBODY align=\"center\"><TR><TH>Name</TH><TH>Val</TH><TH>Unit</TH><TH>Detail</TH></TR>

 
 for(int i = 0; i < U_HtmlLine; i++)
	{
		
		HTTPAddPGMCharToBuffer(&(UECStrtd[0]));
		HTTPAddPGMCharToBuffer(U_html[i].name);
		HTTPAddPGMCharToBuffer(&(UECStdtd[0]));
 // only value
 
 if(U_html[i].pattern == UECSSHOWDATA)
		{
	 if(U_html[i].decimal != 0){
	 dtostrf(((double)*U_html[i].data) / pow(10, U_html[i].decimal), -1, U_html[i].decimal,UECStempStr20);
	 }else{
	 sprintf(UECStempStr20, "%ld", *(U_html[i].data));
	 }
	HTTPAddCharToBuffer(UECStempStr20);
	HTTPAddPGMCharToBuffer(&(UECShtmlInputHidden[0]));
 }
		else if(U_html[i].pattern == UECSINPUTDATA)
			{
	HTTPAddPGMCharToBuffer(&(UECShtmlInputText[0]));
	 dtostrf(((double)*U_html[i].data) / pow(10, U_html[i].decimal), -1, U_html[i].decimal,UECStempStr20);
	HTTPAddCharToBuffer(UECStempStr20);
	HTTPAddPGMCharToBuffer(UECSSlashTagClose);
		 }
		else if(U_html[i].pattern == UECSSELECTDATA)
			{
	HTTPAddPGMCharToBuffer(&(UECShtmlSelect[0]));
	
		 

	 
	 for(int j = 0; j < U_html[i].selectnum; j++)
	 {
	 
	HTTPAddPGMCharToBuffer(&(UECShtmlOption[0]));


	HTTPAddValueToBuffer(j);
	 if((int)(*U_html[i].data) == j)
			 	{
			    HTTPAddPGMCharToBuffer(UECSTxtPartSelected);
			 	}
			 		else
			 	{ 
			    HTTPAddPGMCharToBuffer(UECSTagClose);
			 	}
	HTTPAddPGMCharToBuffer(U_html[i].selectname[j]);//************
	 } 
			
			
	HTTPAddPGMCharToBuffer(&(UECShtmlSelectEnd[0])); 
	 
	 
