andotoecno/UARDECS_esp32/lib/esp32_uecs/esp32_uecs.cpp
	 }
		else if(U_html[i].pattern == UECSSHOWSTRING)
			{
	HTTPAddPGMCharToBuffer(U_html[i].selectname[(int)*(U_html[i].data)]);//************
	HTTPAddPGMCharToBuffer(&(UECShtmlInputHidden[0])); 
		 }

 
 
HTTPAddPGMCharToBuffer(&(UECStdtd[0])); 
HTTPAddPGMCharToBuffer(U_html[i].unit); 
HTTPAddPGMCharToBuffer(&(UECStdtd[0])); 
HTTPAddPGMCharToBuffer(U_html[i].detail); 
HTTPAddPGMCharToBuffer(&(UECStdtr[0])); //</td></tr> 
  
 }


HTTPAddPGMCharToBuffer(&(UECShtmlTABLECLOSE[0])); //</TBODY></TABLE>
HTTPAddPGMCharToBuffer(&(UECShtmlSUBMIT[0])); // <input name=\"b\" type=\"submit\" value=\"send\">
HTTPAddPGMCharToBuffer(&(UECSformend[0])); //</form> 
 
}
HTTPAddPGMCharToBuffer(&(UECShtmlRETURNINDEX[0])); //<P align=\"center\">return <A href=\"index.htm\">Top</A></P>
HTTPAddPGMCharToBuffer(&(UECShtmlHTMLCLOSE[0])); 
 
  
 HTTPCloseBuffer();
}

//---------------------------------------------####################
//---------------------------------------------####################
//---------------------------------------------####################
void HTTPGetFormDataCCMPage()
{
if(U_HtmlLine==0){return;}

int i;
int startPos=0;
int progPos=0;
long tempValue;
unsigned char tempDecimal;


for(i=0;i<U_HtmlLine;i++)
	{
	if(!UECSFindPGMChar(&UECSbuffer[startPos],UECSaccess_LEQUAL,&progPos)){continue;}
	startPos+=progPos;

		if(U_html[i].pattern == UECSINPUTDATA)
				{
				
				if(!UECSGetFixedFloatValue(&UECSbuffer[startPos],&tempValue,&tempDecimal,&progPos)){return;}
				startPos+=progPos;
				if(UECSbuffer[startPos]!='&'){return;}//last '&' not found
				
			    int dif_decimal=U_html[i].decimal-tempDecimal;
			    if(dif_decimal>=0){*U_html[i].data = tempValue*pow(10,dif_decimal);}
			    else{*U_html[i].data = tempValue/pow(10,-dif_decimal);}

				if(*U_html[i].data<U_html[i].minValue){*U_html[i].data=U_html[i].minValue;}
				if(*U_html[i].data>U_html[i].maxValue){*U_html[i].data=U_html[i].maxValue;}
				}
		else if(U_html[i].pattern == UECSSELECTDATA)
				{
				
				if(!UECSGetFixedFloatValue(&UECSbuffer[startPos],&tempValue,&tempDecimal,&progPos)){return;}
				startPos+=progPos;
				
				if(UECSbuffer[startPos]!='&'){return;}//last '&' not found
				
				if(tempDecimal!=0){return;}
				*U_html[i].data=tempValue%U_html[i].selectnum;//cut too big value
				}

	
				
				
	}
	
	
	OnWebFormRecieved();
	
for(i = 0; i < U_HtmlLine; i++)
	       {UECS_EEPROM_writeLong(EEPROM_OFFSET_WEBDATA + i * 4, *(U_html[i].data));}


}
//--------------------------------------------------------------------------
void HTTPGetFormDataLANSettingPage()
{
	int i;
	int startPos=0;
	int progPos=0;
	long UECStempValue[20];
	unsigned char tempDecimal;
	//
	//MYIP      4
	//SUBNET    4
	//GATEWAY   4
	//DNS       4
	//room      1
	//region    1
	//order     1
	//-------------
	//total    19

	//get value
	for(i=0;i<19;i++)
	{
		if(!UECSFindPGMChar(&UECSbuffer[startPos],UECSaccess_LEQUAL,&progPos)){return ;}
		startPos+=progPos;
		if(!UECSGetFixedFloatValue(&UECSbuffer[startPos],&UECStempValue[i],&tempDecimal,&progPos)){return ;}
		startPos+=progPos;
		if(UECSbuffer[startPos]!='&'){return ;}//last '&' not found
		if(tempDecimal!=0){return ;}
		
		//check value and write
		if(i<18 && (UECStempValue[i]<0 || UECStempValue[i]>255)){return ;}//IP address,room,region
		else if (UECStempValue[i]<0 || UECStempValue[i]>30000){return ;}//order
	}

	   //order requires 2byte
       //UECStempValue[18]	order low
       //UECStempValue[19]	order high
       //set "order" high-byte
       UECStempValue[19]=(UECStempValue[18]/256)&127;
       	   
       for(int i = 0; i < 20; i++)
       		{
           	if(EEPROM.read(EEPROM_OFFSET_DATATOP + i)!=(unsigned char)UECStempValue[i])//skip same value
           		{
           	        EEPROM.write(EEPROM_OFFSET_DATATOP + i, (unsigned char)UECStempValue[i]);
           	        U_orgAttribute.status |= STATUS_NEEDRESET;
           	        
           		}
       		}
       		
       	//---------------------------NODE NAME
       	if(!UECSFindPGMChar(&UECSbuffer[startPos],UECSaccess_LEQUAL,&progPos)){return ;}
		startPos+=progPos;
		

		//copy node name
		for(i=0;i<20;i++)
		{
		
		if(UECSbuffer[startPos+i]=='<' || UECSbuffer[startPos+i]=='>')//eliminate tag
			{UECSbuffer[startPos+i]='*';}
			
			if(UECSbuffer[startPos+i]=='&'){break;}
			if(UECSbuffer[startPos+i]=='\0' || i==19){return;}//�I�[�������̂Ŗ���
			//prevention of Cutting multibyte UTF-8 code
			if(i>=16 && (unsigned char)UECSbuffer[startPos+i]>=0xC0)//UTF-8 multibyte code header
				{

				break;
				}

			UECStempStr20[i]=UECSbuffer[startPos+i];
		}

		UECStempStr20[i]='\0';//set end code

       for(int i = 0; i < 20; i++)
       		{
       		U_nodename[i]=UECStempStr20[i];
       			
           	if(EEPROM.read(EEPROM_OFFSET_NODENAME + i)!=U_nodename[i])//skip same value
           		{
           	        EEPROM.write(EEPROM_OFFSET_NODENAME + i, U_nodename[i]);
           		}
       		}

	return ;

}

//---------------------------------------------####################
void HTTPcheckRequest(){
UECSclient=UECSlogserver.available();
  //Caution! This function can not receive only up to the top 299 bytes.
  //Dropped string will be ignored.
  
  if(UECSclient)
  {
      
      //Add null termination 
      UECSbuffer[UECSclient.read((uint8_t *)UECSbuffer,BUF_SIZE-1)]='\0';
      

      HTTPFilterToBuffer();//Get first line before "&S=" and eliminate unnecessary code
			int progPos = 0;
			if(UECSFindPGMChar(UECSbuffer,&(UECSaccess_NOSPC_GETP0[0]),&progPos))
			{HTTPsendPageIndex();}
		else if(UECSFindPGMChar(UECSbuffer,&(UECSaccess_NOSPC_GETP1[0]),&progPos))
			{HTTPsendPageCCM();}
		else if(UECSFindPGMChar(UECSbuffer,&(UECSaccess_NOSPC_GETP2[0]),&progPos))
			{HTTPsendPageLANSetting();}
		else if(UECSFindPGMChar(UECSbuffer,&(UECSaccess_NOSPC_GETP1A[0]),&progPos))//include form data
				{
				HTTPGetFormDataCCMPage();
				//HTTPsendPageCCM();
				HTTPPrintRedirectP1();
				}
		else if(UECSFindPGMChar(UECSbuffer,&(UECSaccess_NOSPC_GETP2A[0]),&progPos))//include form data
				{
				HTTPGetFormDataLANSettingPage();
				HTTPsendPageLANSetting();
				}
		else {HTTPsendPageError();}
  }
  UECSclient.stop();
}



//////////////////
//// html ////////
//////////////////

void UECSupdate16520portReceive( UECSTEMPCCM* _tempCCM, unsigned long _millis){
  int packetSize = UECS_UDP16520.parsePacket();
  int matchCCMID=-1;
  if(packetSize){
  	  
   	ClearMainBuffer();
    _tempCCM->address = UECS_UDP16520.remoteIP();   
    UECSbuffer[UECS_UDP16520.read(UECSbuffer, BUF_SIZE-1)]='\0';
    UDPFilterToBuffer();

    if(UECSparseRec( _tempCCM,&matchCCMID))
    	{UECScheckUpDate( _tempCCM, _millis,matchCCMID);}


