andotoecno/UARDECS_esp32/lib/esp32_uecs/esp32_uecs.cpp
  }

}

void UECSupdate16529port( UECSTEMPCCM* _tempCCM){

  int packetSize = UECS_UDP16529.parsePacket();
   if(packetSize){
   	   
   	   ClearMainBuffer();
      _tempCCM->address = UECS_UDP16529.remoteIP();   
      UECSbuffer[UECS_UDP16529.read(UECSbuffer, BUF_SIZE-1)]='\0';
	  UDPFilterToBuffer();
	  
	  
      if(UECSresNodeScan()){
         UECS_UDP16529.beginPacket(_tempCCM->address, 16529);
         UECS_UDP16529.write(UECSbuffer);
         
         if(UECS_UDP16529.endPacket()==0)
         	{
  			UECSresetEthernet(); //when udpsend failed,reset ethernet status
         	}
      }     
   }

}
//----------------------------------


void UECSsetup(){
delay(500);
pinMode(U_InitPin,INPUT_PULLUP);

Serial.begin(115200);
WiFi.begin(WiFi_SSID, WiFi_PASS);
while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    Serial.println("connecting");
  }
   Serial.println(WiFi.localIP());

if(digitalRead(U_InitPin) == U_InitPin_Sense || UECS_EEPROM_readLong(EEPROM_OFFSET_IP)==-1)
	{
	U_orgAttribute.status|=STATUS_SAFEMODE;
    }
	 else
	 {
	 U_orgAttribute.status&=STATUS_SAFEMODE_MASK;//Release safemode
	 }

  UECSinitOrgAttribute();
  UECSinitCCMList();
  UserInit();
  UECSstartEthernet();
  
}


void UECSstartEthernet(){
  
  if(U_orgAttribute.status&STATUS_SAFEMODE)
  	{
  	byte defip[]     = {192,168,1,7};
  	//byte defsubnet[] = {255,255,255,0};
  	byte defdummy[] = {0,0,0,0};
  	Ethernet.begin(U_orgAttribute.mac, defip, defdummy,defdummy,defdummy);
  	}
  	else
    {
    Ethernet.begin(U_orgAttribute.mac, U_orgAttribute.ip, U_orgAttribute.dns, U_orgAttribute.gateway, U_orgAttribute.subnet);
    }

  UECSlogserver.begin();
  UECS_UDP16520.begin(16520);
  UECS_UDP16529.begin(16529);
}

//---------------------------------------------------------
void UECSresetEthernet()
{
  	//UECS_UDP16520.stop();
  	//UECS_UDP16529.stop();
  	//SPI.end();
  	UECSstartEthernet();
}
//------------------------------------------------------------------------
//Software reset command
// call 0
typedef int (*CALLADDR)(void);
void SoftReset(void)
{
CALLADDR resetAddr=0;
(resetAddr)();
}
//---------------------------------------------------------
//---------------------------------------------------------
//----------------------------------------------------------------------

void UECSloop(){

  // network Check
  // 1. http request
  // 2. udp16520Receive
  // 3. udp16529Receive and Send
  // << USER MANAGEMENT >>
  // 4. udp16520Send
  HTTPcheckRequest();
  UECSupdate16520portReceive(&UECStempCCM, UECSnowmillis);
  UECSupdate16529port(&UECStempCCM);
  UserEveryLoop();  

 UECSnowmillis = millis();
 if(UECSnowmillis==UECSlastmillis){return;}
 
//how long elapsed?
unsigned long td=UECSnowmillis-UECSlastmillis;
//check overflow 
if(UECSnowmillis<UECSlastmillis)
	{
	td=(4294967295-UECSlastmillis)+UECSnowmillis;
	}

//over 1msec
	UECSsyscounter1s+=td;
	UECSlastmillis=UECSnowmillis;
	UECSautomaticValidManager(td);


  if(UECSsyscounter1s < 999){return;}
//over 1000msec
    UECSsyscounter1s = 0;
    UECSsyscounter60s++;
    
    if(UECSsyscounter60s >= 60)
    {
      UserEveryMinute();
      UECSsyscounter60s = 0;  
    }   
    
    
    UECSautomaticSendManager();
    UserEverySecond();
    
    for(int i = 0; i < U_MAX_CCM; i++)
      {
     if(U_ccmList[i].sender && U_ccmList[i].flagStimeRfirst && U_ccmList[i].ccmLevel != NONE)
     	{
        UECSCreateCCMPacketAndSend(&U_ccmList[i]);
        //U_ccmList[i].old_value=U_ccmList[i].value;
       }
    }   

}
//------------------------------------------------------
void UECSinitOrgAttribute(){
	
	  for(int i = 0; i < 4; i++)
	  	{
	  	U_orgAttribute.ip[i]		= EEPROM.read(i + EEPROM_OFFSET_IP);
	  	U_orgAttribute.subnet[i]	= EEPROM.read(i + EEPROM_OFFSET_SUBNET);
	  	U_orgAttribute.gateway[i]	= EEPROM.read(i + EEPROM_OFFSET_GATEWAY);
	  	U_orgAttribute.dns[i]		= EEPROM.read(i + EEPROM_OFFSET_DNS);
	  	}


	//reset web form
	  	for(int i = 0; i < U_HtmlLine; i++)
	  	{
	     *(U_html[i].data) = U_html[i].minValue;
	 	} 

	  U_orgAttribute.room 	=  EEPROM.read(EEPROM_OFFSET_ROOM);
	  U_orgAttribute.region =  EEPROM.read(EEPROM_OFFSET_REGION);
	  U_orgAttribute.order 	=  EEPROM.read(EEPROM_OFFSET_ORDER_L)+ (unsigned short)(EEPROM.read(EEPROM_OFFSET_ORDER_H))*256;
	 if(U_orgAttribute.order>30000){U_orgAttribute.order=30000;}

if(U_orgAttribute.status & STATUS_SAFEMODE){return;}


	  for(int i = 0; i < 20; i++)
	  	  {
		     U_nodename[i] = EEPROM.read(EEPROM_OFFSET_NODENAME + i);
		  }
		  
	 for(int i = 0; i < U_HtmlLine; i++)
		 {
	     *(U_html[i].data) = UECS_EEPROM_readLong(EEPROM_OFFSET_WEBDATA + i * 4);
		 } 
}
//------------------------------------------------------
void UECSinitCCMList(){
  for(int i = 0; i < U_MAX_CCM; i++){
    U_ccmList[i].ccmLevel = NONE;
    U_ccmList[i].validity = false;
    U_ccmList[i].flagStimeRfirst = false;
    U_ccmList[i].recmillis = 0; 

	/*
    U_ccmList[i].address[0] = 255;
    U_ccmList[i].address[1] = 255;
    U_ccmList[i].address[2] = 255;
    U_ccmList[i].address[3] = 255;
    U_ccmList[i].typeTxt[0]='\0';
    U_ccmList[i].attribute[AT_ROOM] = 1;
    U_ccmList[i].attribute[AT_REGI] = 1;
    U_ccmList[i].attribute[AT_ORDE] = 1;
    U_ccmList[i].attribute[AT_PRIO] = 29;
    U_ccmList[i].baseAttribute[AT_ROOM] = U_orgAttribute.room;
    U_ccmList[i].baseAttribute[AT_REGI] = U_orgAttribute.region;
    U_ccmList[i].baseAttribute[AT_ORDE] = U_orgAttribute.order;
    U_ccmList[i].baseAttribute[AT_PRIO] = 29;
    */
  }
}

void UECSsetCCM(boolean _sender, signed char _num, const char* _name, const char* _type, const char* _unit, unsigned short _priority, unsigned char _decimal, char _ccmLevel)
{
  if(_num > U_MAX_CCM || _num < 0){
    return;
  }
  U_ccmList[_num].sender = _sender;
  U_ccmList[_num].ccmLevel = _ccmLevel;
  

  U_ccmList[_num].name = _name;    
  U_ccmList[_num].type = _type;
  U_ccmList[_num].unit = _unit;    
  U_ccmList[_num].baseAttribute[AT_ROOM] = U_orgAttribute.room;
  U_ccmList[_num].baseAttribute[AT_REGI] = U_orgAttribute.region;
  U_ccmList[_num].baseAttribute[AT_ORDE] = U_orgAttribute.order;
  U_ccmList[_num].attribute[AT_ROOM] = 0;
  U_ccmList[_num].attribute[AT_REGI] = 0;
  U_ccmList[_num].attribute[AT_ORDE] = 0;    
  U_ccmList[_num].attribute[AT_PRIO] = _priority;  
  U_ccmList[_num].decimal = _decimal;
  U_ccmList[_num].ccmLevel = _ccmLevel;
  U_ccmList[_num].address[0] = 255;
  U_ccmList[_num].address[1] = 255;    
  U_ccmList[_num].address[2] = 255;
  U_ccmList[_num].address[3] = 255;    
  return ;
}

//####################################String Buffer control
static int wp;
void ClearMainBuffer()
{
UECSbuffer[0]='\0';
wp=0;
}
//-----------------------------------
void UDPAddPGMCharToBuffer(const char* _romword)
{
   for(int i = 0; i <= MAXIMUM_STRINGLENGTH; i++)
   {
    UECSbuffer[wp]=pgm_read_byte(&_romword[i]);
    if(UECSbuffer[wp]=='\0'){break;}
    wp++;
  }
  
      MemoryWatching();

