andotoecno/UARDECS_esp32/lib/esp32_uecs/esp32_uecs.cpp
}
//-----------------------------------
void UDPAddCharToBuffer(char* word){
	strcat(UECSbuffer,word);
	wp=strlen(UECSbuffer);
	
	 MemoryWatching();

}
//-----------------------------------
void UDPAddValueToBuffer(long value){
	sprintf(&UECSbuffer[wp], "%ld", value);
	wp=strlen(UECSbuffer);
	
	MemoryWatching();

}
//-----------------------------------
void HTTPAddPGMCharToBuffer(const char* _romword)
{
   for(int i = 0; i <= MAXIMUM_STRINGLENGTH; i++)
   {
    UECSbuffer[wp]=pgm_read_byte(&_romword[i]);
    if(UECSbuffer[wp]=='\0'){break;}
    wp++;
    //auto send
    if(wp>BUF_HTTP_REFRESH_SIZE)
    		{
			HTTPRefreshBuffer();
    		}
  }
  
      MemoryWatching();

}
//---------------------------------------------
void HTTPAddCharToBuffer(char* word)
{
   for(int i = 0; i <= MAXIMUM_STRINGLENGTH; i++)
   {
    UECSbuffer[wp]=word[i];
    if(UECSbuffer[wp]=='\0'){break;}
    wp++;
    //auto send
    if(wp>BUF_HTTP_REFRESH_SIZE)
    		{
			HTTPRefreshBuffer();
    		}
  }
	    MemoryWatching();


}
//---------------------------------------------
void HTTPAddValueToBuffer(long value)
{
sprintf(&UECSbuffer[wp], "%ld", value);
wp=strlen(UECSbuffer);

if(wp>BUF_HTTP_REFRESH_SIZE)
    		{
			HTTPRefreshBuffer();
    		}
   
   MemoryWatching();
}
void HTTPRefreshBuffer(void)
{
	
	
    UECSbuffer[wp]='\0';
    UECSclient.print(UECSbuffer);
    ClearMainBuffer();
    

}
void HTTPCloseBuffer(void)
{
	
if(strlen(UECSbuffer)>0)
	{UECSclient.print(UECSbuffer);}

}
//------------------------------------
//delete \r,\n and contorol code
//replace the continuous space character to 1 space
//Attention:first one character is ignored without delete.
//------------------------------------
void UDPFilterToBuffer(void)
{


int s_size=strlen(UECSbuffer);
int write=0,read=0;
int i,j;
  for(i=1;i<s_size;i++)
  {
    if(UECSbuffer[i]=='\0'){break;}
    
    //find space
    if(UECSbuffer[i]<ASCIICODE_SPACE || (UECSbuffer[i]==ASCIICODE_SPACE && UECSbuffer[i-1]==ASCIICODE_SPACE))
      {
        write=i;
        //find end of space
        for(j=write;j<=s_size;j++)
          {
          if(UECSbuffer[j]>ASCIICODE_SPACE || UECSbuffer[j]=='\0')
            {
            read=j;
            break;
            }
          }
        //copy str to fill space
        for(j=read;j<=s_size;j++)
          {
          UECSbuffer[write+(j-read)]=UECSbuffer[j];
          }
        }
        
        
  }
  MemoryWatching();



}
//------------------------------------
//delete space and contorol code for http response
//\r,\n is regarded to end
//Attention:first one character is ignored without delete.
//decode URL like %nn to char code
//------------------------------------
void HTTPFilterToBuffer(void)
{
int s_size=strlen(UECSbuffer);
int write=0,read=0;
int i,j;

  //decode after %
  for(i=1;i<s_size;i++)
  {
    if((unsigned char)UECSbuffer[i]<ASCIICODE_SPACE || (UECSbuffer[i-1]=='&' && UECSbuffer[i]=='S' && UECSbuffer[i+1]=='=')){UECSbuffer[i]='\0';break;}
    
    if(UECSbuffer[i]=='%')
    	{
    	unsigned char decode=0;
    	if(UECSbuffer[i+1]>='A' && UECSbuffer[i+1]<='F'){decode=UECSbuffer[i+1]+10-'A';}
    	else if(UECSbuffer[i+1]>='a' && UECSbuffer[i+1]<='f'){decode=UECSbuffer[i+1]+10-'a';}
    	else if(UECSbuffer[i+1]>='0' && UECSbuffer[i+1]<='9'){decode=UECSbuffer[i+1]-'0';}
    	
    	if(decode!=0)
	    	{
	    	decode=decode*16;
	    	if(UECSbuffer[i+2]>='A' && UECSbuffer[i+2]<='F'){decode+=UECSbuffer[i+2]+10-'A';}
	    	else if(UECSbuffer[i+2]>='a' && UECSbuffer[i+2]<='f'){decode+=UECSbuffer[i+2]+10-'a';}
	    	else if(UECSbuffer[i+2]>='0' && UECSbuffer[i+2]<='9'){decode+=UECSbuffer[i+2]-'0';}
	    	else {decode=0;}

	    	if(decode!=0)
		    		{
		    		if(decode=='&'){decode='*';}
		    		UECSbuffer[i]=decode;
		    		UECSbuffer[i+1]=' ';
		    		UECSbuffer[i+2]=' ';
		    		}
	    	}
    	
    	}
  
  }

  s_size=strlen(UECSbuffer);
  
  for(i=1;i<s_size;i++)
  {
  	//eliminate tag
	//if(UECSbuffer[i]=='<' || UECSbuffer[i]=='>'){UECSbuffer[i]=' ';}
    
    //find space
    if(UECSbuffer[i]<=ASCIICODE_SPACE)
      {
        write=i;
        //find end of space
        for(j=write;j<=s_size;j++)
          {
          if((unsigned char)(UECSbuffer[j])>ASCIICODE_SPACE || UECSbuffer[j]=='\0')
            {
            read=j;
            break;
            }
          }
        //copy str to fill space
        for(j=read;j<=s_size;j++)
          {
          UECSbuffer[write+(j-read)]=UECSbuffer[j];
          }
        }
  }
  MemoryWatching();

  
}

//------------------------------------
bool UECSFindPGMChar(char* targetBuffer,const char *_romword_startStr,int *lastPos)
{
*lastPos=0;
int startPos=-1;
int _targetBuffersize=strlen(targetBuffer);
int _startStrsize=strlen_P(_romword_startStr);
if(_targetBuffersize<_startStrsize){return false;}


int i,j;

//-------------start string check
unsigned char startchr=pgm_read_byte(&_romword_startStr[0]);
for(i=0;i<_targetBuffersize-_startStrsize+1;i++)
	{
	//not hit
	if(targetBuffer[i]!=startchr){continue;}
	
	//if hit 1 chr ,more check
	for(j=0;j<_startStrsize;j++)
			{
			if(targetBuffer[i+j]!=pgm_read_byte(&_romword_startStr[j])){break;}//not hit!
			}
	//hit all chr
	if(j==_startStrsize)
		{
		startPos=i;
		break;
		}
	
	}

if(startPos<0){return false;}
*lastPos=startPos+_startStrsize;
return true;

}

//------------------------------------
bool UECSGetValPGMStrAndChr(char* targetBuffer,const char *_romword_startStr, char end_asciiCode,short *shortValue,int *lastPos)
{
int _targetBuffersize=strlen(targetBuffer);
*lastPos=-1;
int startPos=-1;
int i;
if(!UECSFindPGMChar(targetBuffer,_romword_startStr,&startPos)){false;}



if(targetBuffer[startPos]<'0' || targetBuffer[startPos]>'9'){return false;}
//------------end code check
for(i=startPos;i<_targetBuffersize;i++)
{
if(targetBuffer[i]=='\0'){return false;}//no end code found
if(targetBuffer[i]==end_asciiCode)
	{break;}
	
}


if(i>=_targetBuffersize){return false;}//not found
*lastPos=i;

//*shortValue=UECSAtoI(&targetBuffer[startPos]);
long longVal;
unsigned char decimal;
int progPos;
if(!(UECSGetFixedFloatValue(&targetBuffer[startPos],&longVal,&decimal,&progPos))){return false;}

if(decimal!=0){return false;}
*shortValue=(short)longVal;
if(*shortValue != longVal){return false;}//over flow!

